In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv("StockData.csv")

In [3]:
df2=pd.read_excel("new.xlsx")

In [4]:
df.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [5]:
df.tail()

     stock        date  price
5031   ZTS  01-02-2018  77.82
5032   ZTS  02-02-2018  76.78
5033   ZTS  05-02-2018  73.83
5034   ZTS  06-02-2018  73.27
5035   ZTS  07-02-2018  73.86

In [6]:
df.sample()

     stock        date  price
2318   SNI  25-04-2017  75.96

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   object
 2   price   5036 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.2+ KB

In [8]:
df.isnull().sum()

stock    0
date     0
price    0
dtype: int64

In [9]:
df.dtypes

stock     object
date      object
price    float64
dtype: object

In [10]:
df.duplicated().sum()

0

In [11]:
df.describe()

             price
count  5036.000000
mean     73.057030
std      29.011126
min      28.400000
25%      54.067500
50%      69.085000
75%      79.250000
max     179.260000

In [12]:
df.shape

(5036, 3)

In [13]:
df['price'].min()

28.4

In [14]:
df['price'].max()

179.26

In [17]:
df[df['price']==df['price'].min()]

     stock        date  price
4072   ZTS  11-04-2014   28.4

In [18]:
df[df['price']==df['price'].max()]

     stock        date   price
1244  AAPL  18-01-2018  179.26

In [20]:
df['stock'].unique()

array(['AAPL', 'SNI', 'TJX', 'ZTS'], dtype=object)

In [21]:
df['stock'].nunique()

4

In [22]:
df['stock'].value_counts(normalize=True)

stock
AAPL    0.25
SNI     0.25
TJX     0.25
ZTS     0.25
Name: proportion, dtype: float64

In [23]:
df2.head()

  stock                 date    price
0  AAPL  2013-08-02 00:00:00  67.8542
1  AAPL  2013-11-02 00:00:00      NaN
2  AAPL  2013-12-02 00:00:00      NaN
3  AAPL           13-02-2013      NaN
4  AAPL           14-02-2013  66.6556

In [24]:
df2.isnull().sum()

stock    0
date     0
price    3
dtype: int64

In [30]:
df2['price'].fillna(df2['price'].mean(), inplace=True)

In [31]:
df2.isnull().sum()

stock    0
date     0
price    0
dtype: int64

In [32]:
round(df['price'].mean(),3)

73.057

In [33]:
round(df['price'].median(),3)

69.085

In [34]:
round(df['price'].mode(),3)

0    74.59
Name: price, dtype: float64

In [35]:
df.groupby('stock')['price'].sum()

stock
AAPL    137314.9734
SNI      89790.8800
TJX      84030.1500
ZTS      56779.1980
Name: price, dtype: float64

In [36]:
df.groupby('stock')['price'].mean()

stock
AAPL    109.066698
SNI      71.319206
TJX      66.743566
ZTS      45.098648
Name: price, dtype: float64

In [38]:
df.groupby('stock')['price'].median()

stock
AAPL    109.01
SNI      72.31
TJX      68.85
ZTS      45.62
Name: price, dtype: float64

In [39]:
df.sort_values(by='price')

     stock        date   price
4072   ZTS  11-04-2014   28.40
4073   ZTS  14-04-2014   28.48
4075   ZTS  16-04-2014   28.53
4074   ZTS  15-04-2014   28.55
4076   ZTS  17-04-2014   28.60
...    ...         ...     ...
1247  AAPL  23-01-2018  177.04
1241  AAPL  12-01-2018  177.09
1245  AAPL  19-01-2018  178.46
1243  AAPL  17-01-2018  179.10
1244  AAPL  18-01-2018  179.26

[5036 rows x 3 columns]

In [40]:
df.sort_values(by='price',ascending=False)

     stock        date   price
1244  AAPL  18-01-2018  179.26
1243  AAPL  17-01-2018  179.10
1245  AAPL  19-01-2018  178.46
1241  AAPL  12-01-2018  177.09
1247  AAPL  23-01-2018  177.04
...    ...         ...     ...
4076   ZTS  17-04-2014   28.60
4074   ZTS  15-04-2014   28.55
4075   ZTS  16-04-2014   28.53
4073   ZTS  14-04-2014   28.48
4072   ZTS  11-04-2014   28.40

[5036 rows x 3 columns]

In [43]:
df_n=pd.read_csv("Predictive_Maintenance_Case_Study.csv")
df_n

,UDI,Type,Air temperature,Process temperature,Rotational speed,Torque,Tool wear,Failure
0,1,M,298.1,323.740741,1551,42.8,0,0
1,2,L,298.2,324.111111,1408,46.3,3,0
2,3,L,298.1,323.370370,1498,49.4,5,0
3,4,L,298.2,323.740741,1433,39.5,7,0
4,5,L,298.2,324.111111,1408,40.0,9,0
...,...,...,...,...,...,...,...,...
9995,9996,M,298.8,323.000000,1604,29.5,14,0
9996,9997,H,298.9,323.000000,1632,31.8,17,0
9997,9998,M,299.0,323.740741,1645,33.4,22,0
9998,9999,H,299.0,324.111111,1408,48.5,25,0
9999,10000,M,299.0,324.111111,1500,40.2,30,0